enum MarkType { unknown, correct }

extension MarkTypeExt on MarkType {
  String get emoji {
    switch (this) {
      case MarkType.unknown:
        return "❓";
      case MarkType.correct:
        return "✔️";
    }
  }

  static String toggle(String emoji) => emoji == MarkType.unknown.emoji
      ? MarkType.correct.emoji
      : MarkType.unknown.emoji;
}

List<String> guessItem = [
  // 水果类
  "🍎", "🍌", "🍇", "🍓", "🥝", "🍊", "🍉", "🍑", "🍒", "🍍", "🥭", "🥑",
  "🍈", "🍋", "🍐", "🥥",

  // 蔬菜类
  "🥕", "🥬", "🥦", "🍅", "🥒", "🧅", "🧄", "🥔",

  // 动物类
  "🐶", "🐱", "🐭", "🐹", "🐰", "🦊", "🐻", "🐼", "🐨", "🐯", "🦁", "🐮",
  "🐷", "🐸", "🐵", "🐔", "🐧", "🐦", "🐺", "🐴",

  // 交通工具类
  "🚗", "🚲", "✈️", "🚂", "🚢", "🚌", "🏍", "🚕", "🚚", "🚜", "🛵", "🚒",
  "🚑", "🚓", "🚁", "🛴", "🚀",

  // 日常用品类
  "📱", "💻", "⌚", "📚", "✏️", "🔑", "🧴", "💡", "🔦", "🔮", "🧲", "🧿",
  "📖", "✒️", "🖋", "📝", "📎", "📌", "✂️", "🧻", "🧼", "🧽", "🚿",

  // 装饰/节日类
  "🎃", "🎈", "🎉", "🎊", "🍀", "🎁", "🎄", "🎋", "🎍", "🎐", "🎆", "🎇",
  "🎀",

  // 食物类
  "🍔", "🍟", "🍕", "🌭", "🍿", "🍩", "🍜", "🍝", "🍲", "🍣", "🍤",
  "🍗", "🍖", "🥩", "🥓",

  // 自然元素
  "🌞", "🌙", "⭐", "☁️", "🌧", "❄️", "🌪", "🌈", "🌊", "🌋", "🌳", "🌲",
  "🌴", "🌱", "🌿",

  // 运动相关
  "🏀", "⚽", "🏈", "⚾", "🎾", "🏐", "🏉", "🎳", "⛳", "🎣", "🏊", "🚴",
  "🏃", "🚶", "🤸", "🤼",
];
